# 通过for 循环， 对所有级别为1 级别为1 级员工，级别上升1 级，薪水增加1000元

my_dict = {"王力宏": {"部门:": "科技部", "工资": 3000, "级别": 1},
           "周杰伦": {"部门:": "市场部", "工资": 5000, "级别": 2},
           "林俊杰": {"部门:": "市场部", "工资": 7000, "级别": 3},
           "张学友": {"部门:": "科技部", "工资": 4000, "级别": 1},
           "刘德华": {"部门:": "市场部", "工资": 6000, "级别": 2}
          }
print("群体员工当前信息如下:")
for name in my_dict:
    print(f"{name}:", end='')
    print(f"{my_dict[name]}")
print()

print("全体员工级别为1 的员工完成升职加薪操作，操作后:")
for name in my_dict:
    if my_dict[name]['级别'] == 1:
        my_dict[name]['级别'] += 1
        my_dict[name]['工资'] += 1000
    print(f"{name}:", end = '')
    print(f"{my_dict[name]}")

